public/man/man1/whereis.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - whereis.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - whereis.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>whereis - locate the binary, source, and manual page files for a command</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>whereis</strong> [options] [*-BMS* <em>directory</em>… *-f*] <em>name</em>…</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>whereis</strong> locates the binary, source and manual files for the specified
command names. The supplied names are <strong>first stripped of leading
pathname components</strong>. Prefixes of <strong>s.</strong> resulting from use of source code
control are also dealt with. <strong>whereis</strong> then attempts to locate the
desired program in the standard Linux places, and in the places
specified by <strong>$PATH</strong> and <strong>$MANPATH</strong>.</p>
<p>
The search restrictions (options <strong>-b</strong>, <strong>-m</strong> and <strong>-s</strong>) are cumulative and
apply to the subsequent <em>name</em> patterns on the command line. Any new
search restriction resets the search mask. For example,</p>
<blockquote>
<p><strong>whereis -bm ls tr -m gcc</strong>\\</p>
</blockquote>
<p>
searches for &#34;ls&#34; and &#34;tr&#34; binaries and man pages, and for &#34;gcc&#34; man
pages only.</p>
<p>
The options <strong>-B</strong>, <strong>-M</strong> and <strong>-S</strong> reset search paths for the subsequent
<em>name</em> patterns. For example,</p>
<blockquote>
<p><strong>whereis -m ls -M /usr/share/man/man1 -f cal</strong>\\</p>
</blockquote>
<p>
searches for &#34;<strong>ls</strong>&#34; man pages in all default paths, but for &#34;cal&#34; in the
<em>/usr/share/man/man1</em> directory only.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-b</strong></p>
<blockquote>
<p>Search for binaries.</p>
</blockquote>
<p>
<strong>-m</strong></p>
<blockquote>
<p>Search for manuals.</p>
</blockquote>
<p>
<strong>-s</strong></p>
<blockquote>
<p>Search for sources.</p>
</blockquote>
<p>
<strong>-u</strong></p>
<blockquote>
<p>Only show the command names that have unusual entries. A command is said
to be unusual if it does not have just one entry of each explicitly
requested type. Thus <strong>whereis -m -u *</strong> asks for those files in the
current directory which have no documentation file, or more than one.</p>
</blockquote>
<p>
<strong>-B</strong> <em>list</em></p>
<blockquote>
<p>Limit the places where <strong>whereis</strong> searches for binaries, by a
whitespace-separated list of directories.</p>
</blockquote>
<p>
<strong>-M</strong> <em>list</em></p>
<blockquote>
<p>Limit the places where <strong>whereis</strong> searches for manuals and documentation
in Info format, by a whitespace-separated list of directories.</p>
</blockquote>
<p>
<strong>-S</strong> <em>list</em></p>
<blockquote>
<p>Limit the places where <strong>whereis</strong> searches for sources, by a
whitespace-separated list of directories.</p>
</blockquote>
<p>
<strong>-f</strong></p>
<blockquote>
<p>Terminates the directory list and signals the start of filenames. It
<em>must</em> be used when any of the <strong>-B</strong>, <strong>-M</strong>, or <strong>-S</strong> options is used.</p>
</blockquote>
<p>
<strong>-l</strong></p>
<blockquote>
<p>Output the list of effective lookup paths that <strong>whereis</strong> is using. When
none of <strong>-B</strong>, <strong>-M</strong>, or <strong>-S</strong> is specified, the option will output the
hard-coded paths that the command was able to find on the system.</p>
</blockquote>
<p>
<strong>-g</strong></p>
<blockquote>
<p>Interpret the next names as a <strong>glob(7)</strong> patterns. <strong>whereis</strong> always
compares only filenames (aka basename) and never complete path. Using
directory names in the pattern has no effect. Don&#39;t forget that the
shell interprets the pattern when specified on the command line without
quotes. It&#39;s necessary to use quotes for the <em>name</em>, for example:</p>
</blockquote>
<blockquote>
<blockquote>
<pre class="example">
whereis -g find*
</pre>
</blockquote>
<p>
\\</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help text and exit.</p>
</blockquote>
<p>
<strong>-V</strong>, <strong>–version</strong></p>
<blockquote>
<p>Print version and exit.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
FILE SEARCH PATHS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>By default <strong>whereis</strong> tries to find files from hard-coded paths, which
are defined with glob patterns. The command attempts to use the contents
of <strong>$PATH</strong> and <strong>$MANPATH</strong> environment variables as default search path.
The easiest way to know what paths are in use is to add the <strong>-l</strong> listing
option. Effects of the <strong>-B</strong>, <strong>-M</strong>, and <strong>-S</strong> are displayed with <strong>-l</strong>.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
ENVIRONMENT
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*WHEREIS_DEBUG*=all</p>
<blockquote>
<p>enables debug output.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
EXAMPLES
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>To find all files in <em>/usr/bin</em> which are not documented in
<em>/usr/man/man1</em> or have no source in <em>/usr/src</em>:</p>
<blockquote>
<p><strong>cd /usr/bin</strong><br>
<strong>whereis -u -ms -M /usr/man/man1 -S /usr/src -f *</strong>\\</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
REPORTING BUGS
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>For bug reports, use the issue tracker at
&lt;<a href="https://github.com/util-linux/util-linux/issues">https://github.com/util-linux/util-linux/issues</a>&gt;.</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
AVAILABILITY
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>The <strong>whereis</strong> command is part of the util-linux package which can be
downloaded from <em>Linux Kernel Archive</em>
&lt;<a href="https://www.kernel.org/pub/linux/utils/util-linux/">https://www.kernel.org/pub/linux/utils/util-linux/</a>&gt;.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
